{
    "version": "https://jsonfeed.org/version/1",
    "title": "Blog",
    "description": "",
    "home_page_url": "https://lorenzboss.github.io/blog",
    "feed_url": "https://lorenzboss.github.io/blog/feed.json",
    "user_comment": "",
    "author": {
        "name": "Lorenz"
    },
    "items": [
        {
            "id": "https://lorenzboss.github.io/blog/free-analytics-for-your-publii-blog-know-your-readers-without-creeping-them-out/",
            "url": "https://lorenzboss.github.io/blog/free-analytics-for-your-publii-blog-know-your-readers-without-creeping-them-out/",
            "title": "Free Analytics for Your Publii Blog – Know Your Readers Without Creeping Them Out",
            "summary": "Even a simple blog can benefit from analytics. Knowing which posts are&hellip;",
            "content_html": "<p data-start=\"7346\" data-end=\"7655\">Even a simple blog can benefit from analytics. Knowing which posts are popular, where visitors come from, and how they navigate your site helps you create content that resonates. With static websites, traditional analytics tools often feel like overkill, but modern privacy-focused solutions work beautifully.</p>\n<h2 data-start=\"7657\" data-end=\"7686\">Privacy-Friendly Analytics</h2>\n<p data-start=\"7688\" data-end=\"8030\">Tools like <strong data-start=\"7699\" data-end=\"7727\">Cloudflare Web Analytics</strong>, <strong data-start=\"7729\" data-end=\"7738\">Umami</strong>, and <strong data-start=\"7744\" data-end=\"7759\">GoatCounter</strong> provide insights without tracking users with cookies. This means no pop-ups or GDPR banners, and your readers enjoy a clean, uninterrupted experience. Despite being lightweight, these tools still provide meaningful data on page views, popular posts, and traffic sources.</p>\n<h2 data-start=\"8032\" data-end=\"8059\">How It Works With Publii</h2>\n<p data-start=\"8061\" data-end=\"8375\">Adding analytics to Publii is surprisingly easy. You simply paste a short script into the custom HTML header section. Publii ensures it’s included on every page when you sync. No database setup, no plugins, no technical headaches. Your blog stays static, fast, and secure, while still giving you valuable insights.</p>\n<h2 data-start=\"8377\" data-end=\"8399\">Why It’s Motivating</h2>\n<p data-start=\"8401\" data-end=\"8670\">Seeing your content reach people is inspiring. Even knowing that a handful of readers enjoy your posts can motivate you to write more. Analytics shouldn’t feel like spying; it should feel like feedback — a gentle way to understand your audience and refine your content.</p>\n<h2 data-start=\"8672\" data-end=\"8700\">Free Tools That Work Well</h2>\n<ul data-start=\"8702\" data-end=\"8912\">\n<li data-start=\"8702\" data-end=\"8764\">\n<p data-start=\"8704\" data-end=\"8764\"><strong data-start=\"8704\" data-end=\"8733\">Cloudflare Web Analytics:</strong> Free, fast, and cookie-free.</p>\n</li>\n<li data-start=\"8765\" data-end=\"8830\">\n<p data-start=\"8767\" data-end=\"8830\"><strong data-start=\"8767\" data-end=\"8777\">Umami:</strong> Open-source and clean, with optional self-hosting.</p>\n</li>\n<li data-start=\"8831\" data-end=\"8912\">\n<p data-start=\"8833\" data-end=\"8912\"><strong data-start=\"8833\" data-end=\"8849\">GoatCounter:</strong> Lightweight, free for personal use, and simple to implement.</p>\n</li>\n</ul>\n<p data-start=\"8914\" data-end=\"9061\">These tools allow you to track engagement, understand patterns, and make your blog more enjoyable — all while keeping your readers’ privacy intact.</p>",
            "author": {
                "name": "Lorenz"
            },
            "tags": [
                   "Publii",
                   "CMS"
            ],
            "date_published": "2025-11-17T18:21:13+01:00",
            "date_modified": "2025-11-17T18:25:57+01:00"
        },
        {
            "id": "https://lorenzboss.github.io/blog/hosting-a-publii-blog-for-free-its-easier-than-you-think/",
            "url": "https://lorenzboss.github.io/blog/hosting-a-publii-blog-for-free-its-easier-than-you-think/",
            "title": "Hosting a Publii Blog for Free – It’s Easier Than You Think",
            "summary": "One of the most exciting things about Publii is how easy it&hellip;",
            "content_html": "<p data-start=\"5418\" data-end=\"5688\">One of the most exciting things about Publii is how easy it makes hosting a website. Because it’s static, you don’t need expensive servers or complex backend setups. You can get your blog online for free, in minutes, and still have a professional, fast, and secure site.</p>\n<h2 data-start=\"5690\" data-end=\"5717\">Hosting Options for Free</h2>\n<p data-start=\"5719\" data-end=\"5990\">There are several free hosting services that work perfectly with Publii. <strong data-start=\"5792\" data-end=\"5808\">GitHub Pages</strong>, <strong data-start=\"5810\" data-end=\"5821\">Netlify</strong>, and <strong data-start=\"5827\" data-end=\"5837\">Vercel</strong> are among the most popular. Each offers its own advantages, but the core idea is the same: upload your pre-built static files, and your website is live.</p>\n<h3 data-start=\"5992\" data-end=\"6008\">GitHub Pages</h3>\n<p data-start=\"6010\" data-end=\"6280\">GitHub Pages is perfect if you’re familiar with version control. You create a repository, push your static files, and GitHub serves your website for free. You can even use a custom domain. The process is simple once you understand the basics of repositories and commits.</p>\n<h3 data-start=\"6282\" data-end=\"6293\">Netlify</h3>\n<p data-start=\"6295\" data-end=\"6593\">Netlify adds an extra layer of simplicity. It connects directly with Publii, supports automatic SSL, and deploys your site globally via a CDN. You can even set up automatic updates whenever you change your local files. It’s perfect for those who want a hands-off experience after the initial setup.</p>\n<h3 data-start=\"6595\" data-end=\"6605\">Vercel</h3>\n<p data-start=\"6607\" data-end=\"6879\">Vercel is another excellent option, especially if you plan to explore more advanced static sites in the future. It provides fast global hosting and integrates easily with Publii’s sync feature. Custom domains and HTTPS are included, giving your site a professional polish.</p>\n<h2 data-start=\"6881\" data-end=\"6916\">Why Free Hosting Feels Different</h2>\n<p data-start=\"6918\" data-end=\"7239\">Using free hosting for a Publii blog feels empowering. You don’t worry about server crashes, database errors, or monthly fees. Instead, you can focus entirely on creating content. Every time you hit “Sync,” your website magically appears online, secure and fast. For bloggers just starting out, this freedom is priceless.</p>",
            "author": {
                "name": "Lorenz"
            },
            "tags": [
                   "Publii",
                   "CMS"
            ],
            "date_published": "2025-11-17T18:20:56+01:00",
            "date_modified": "2025-11-17T18:25:47+01:00"
        },
        {
            "id": "https://lorenzboss.github.io/blog/what-is-publii-and-why-is-it-a-great-static-cms/",
            "url": "https://lorenzboss.github.io/blog/what-is-publii-and-why-is-it-a-great-static-cms/",
            "title": "Why I Love Publii (and You Might Too)",
            "summary": "If you’ve ever been frustrated by slow CMS dashboards, endless updates, or&hellip;",
            "content_html": "<p data-start=\"3029\" data-end=\"3427\">If you’ve ever been frustrated by slow CMS dashboards, endless updates, or constant security patches, Publii might feel like a breath of fresh air. Unlike traditional CMSs, Publii works locally on your desktop. You write your posts, select a theme, tweak some settings, and when you’re ready, it generates a full static website that can be uploaded anywhere. Fast, secure, and surprisingly elegant.</p>\n<h2 data-start=\"3429\" data-end=\"3448\">How Publii Works</h2>\n<p data-start=\"3450\" data-end=\"3868\">Publii operates offline. You don’t need a web server or database to start. Everything happens locally on your computer. When you click <strong data-start=\"3585\" data-end=\"3593\">Sync</strong>, your entire site — posts, pages, images, and settings — is converted into static files. You can then upload your site using FTP, SFTP, GitHub Pages, Netlify, or any other compatible service. This approach not only improves speed but also drastically reduces security risks.</p>\n<h2 data-start=\"3870\" data-end=\"3895\">Why It Feels Different</h2>\n<p data-start=\"3897\" data-end=\"4348\">What makes Publii special is the balance between simplicity and control. Unlike some static site generators that require you to write Markdown or code templates, Publii provides a polished, user-friendly interface. You can focus on writing, designing, and sharing your content, while Publii handles the technical side. Offline editing also means you can work anywhere — on a train, in a café, or during a hike — without worrying about internet access.</p>\n<h2 data-start=\"4350\" data-end=\"4368\">Who Develops It</h2>\n<p data-start=\"4370\" data-end=\"4718\">Publii is developed by <strong data-start=\"4393\" data-end=\"4408\">TidyCustoms</strong>, an independent team from Poland. Their focus is on simplicity, security, and user experience. The project is actively maintained, and the community around it is supportive and enthusiastic. The team provides a growing collection of themes and helpful documentation, making it approachable even for beginners.</p>\n<h2 data-start=\"4720\" data-end=\"4750\">Why You Might Choose Publii</h2>\n<p data-start=\"4752\" data-end=\"4848\">Publii is ideal for bloggers, creatives, and small business owners who want a website that is:</p>\n<ul data-start=\"4849\" data-end=\"5123\">\n<li data-start=\"4849\" data-end=\"4905\">\n<p data-start=\"4851\" data-end=\"4905\"><strong data-start=\"4851\" data-end=\"4860\">Fast:</strong> Pre-generated pages load almost instantly.</p>\n</li>\n<li data-start=\"4906\" data-end=\"4975\">\n<p data-start=\"4908\" data-end=\"4975\"><strong data-start=\"4908\" data-end=\"4919\">Secure:</strong> No database, no login page — minimal risk of hacking.</p>\n</li>\n<li data-start=\"4976\" data-end=\"5051\">\n<p data-start=\"4978\" data-end=\"5051\"><strong data-start=\"4978\" data-end=\"4998\">Low-maintenance:</strong> No server updates or complicated plugins required.</p>\n</li>\n<li data-start=\"5052\" data-end=\"5123\">\n<p data-start=\"5054\" data-end=\"5123\"><strong data-start=\"5054\" data-end=\"5067\">Flexible:</strong> Publish anywhere, customize themes, and work offline.</p>\n</li>\n</ul>\n<p data-start=\"5125\" data-end=\"5333\">For me, Publii has transformed how I think about blogging. It turns what could be a stressful technical task into a smooth creative workflow. For anyone tired of fighting with complex CMSs, it’s a joy to use.</p>",
            "author": {
                "name": "Lorenz"
            },
            "tags": [
                   "Publii",
                   "CMS"
            ],
            "date_published": "2025-11-17T18:13:53+01:00",
            "date_modified": "2025-11-17T18:25:42+01:00"
        },
        {
            "id": "https://lorenzboss.github.io/blog/dynamic-cms-vs-static-cms-what-is-the-difference/",
            "url": "https://lorenzboss.github.io/blog/dynamic-cms-vs-static-cms-what-is-the-difference/",
            "title": "Dynamic CMS vs. Static CMS – What is the Difference?",
            "summary": "When you start building a website, one of the first and most&hellip;",
            "content_html": "<p data-start=\"323\" data-end=\"710\">When you start building a website, one of the first and most important decisions you’ll face is choosing the right CMS. Content Management Systems make it possible to create, edit, and organize content without touching raw code, but not all CMSs are created equal. Broadly speaking, there are <strong data-start=\"616\" data-end=\"627\">dynamic</strong> and <strong data-start=\"632\" data-end=\"642\">static</strong> systems — each with its own philosophy, advantages, and challenges.</p>\n<h2 data-start=\"712\" data-end=\"740\">What Makes a CMS Dynamic?</h2>\n<p data-start=\"742\" data-end=\"1211\">Dynamic CMSs, like <strong data-start=\"761\" data-end=\"774\">WordPress</strong> or <strong data-start=\"778\" data-end=\"788\">Drupal</strong>, generate your pages on the fly. Every time a visitor clicks on your site, the system pulls content from a database, processes it, and sends a fully built page to the browser. This approach allows for incredible flexibility. You can add user accounts, interactive features, e-commerce plugins, comments, and much more. Editing is also done directly online, which is perfect for teams that need to collaborate in real time.</p>\n<p data-start=\"1213\" data-end=\"1543\">But this flexibility has its price. Dynamic sites are heavier and slower to load because each request requires server processing. They also have a bigger attack surface: databases, login forms, and plugins are all potential security risks. Regular maintenance, backups, and updates are essential to keep the site running smoothly.</p>\n<h2 data-start=\"1545\" data-end=\"1570\">The Rise of Static CMS</h2>\n<p data-start=\"1572\" data-end=\"1910\">Static CMSs like <strong data-start=\"1589\" data-end=\"1599\">Publii</strong>, <strong data-start=\"1601\" data-end=\"1611\">Jekyll</strong>, or <strong data-start=\"1616\" data-end=\"1624\">Hugo</strong> take a different approach. They pre-generate your website as plain HTML, CSS, and JavaScript files before it goes online. When someone visits your site, the server simply serves these ready-made files. This means faster loading times, minimal security risks, and almost no maintenance.</p>\n<p data-start=\"1912\" data-end=\"2208\">Static sites are ideal for personal blogs, portfolios, or small business websites. However, some dynamic features — like user accounts, real-time comments, or e-commerce — require external services. Editing is typically done locally, and collaboration is more limited compared to dynamic systems.</p>\n<h2 data-start=\"2210\" data-end=\"2238\">Pros and Cons in Practice</h2>\n<p data-start=\"2240\" data-end=\"2642\">The choice between dynamic and static ultimately comes down to priorities. Dynamic systems excel when you need flexibility and interactivity. They are ideal for large editorial teams, forums, or content-rich websites. Static systems shine in speed, security, and simplicity. They are low-maintenance, can be hosted cheaply or even for free, and are perfect for people who want a site that “just works.”</p>\n<p data-start=\"2644\" data-end=\"2966\">Choosing the right CMS isn’t just about features; it’s about workflow, audience, and goals. Understanding these differences early saves time and energy later. Whether you opt for dynamic versatility or static simplicity, both paths can lead to a beautiful, functional website — it just depends on what matters most to you.</p>",
            "author": {
                "name": "Lorenz"
            },
            "tags": [
                   "CMS"
            ],
            "date_published": "2025-11-17T18:13:07+01:00",
            "date_modified": "2025-11-17T18:25:36+01:00"
        }
    ]
}
